Revit 2027 API
ExtendedPropertiesLink.CreateFromCloudDataset Method
 Creates the ExtendedPropertiesLink in the given document from a cloud dataset.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static LinkLoadResult CreateFromCloudDataset(
	Document doc,
	string datasetId
)
Public Shared Function CreateFromCloudDataset (
	doc As Document,
	datasetId As String
) As LinkLoadResult
public:
static LinkLoadResult^ CreateFromCloudDataset(
	Document^ doc,
	String^ datasetId
)
static member CreateFromCloudDataset :
        doc : Document *
        datasetId : string -> LinkLoadResult
Parameters
doc Document
 Document which will gain an ExtendedPropertiesLink. The document must correspond to a cloud model.
datasetId String
 The id of the dataset in Autodesk Construction Cloud; it should be hosted in the same project as the document. A valid dataset id should start with "urn:WIPENVIRONMENT:dm.lineage:", followed by an unique identifier. The WIPENVIRONMENT varies from Region to Region. An example of a valid dataset id for an account created in the US Region would be urn:adsk.wipprod:dm.lineage:AoV26TGqRjuNs4ANq84ncQ.
Return Value
LinkLoadResult
 Information about the ExtendedPropertiesLink.
Exceptions
Exception | Condition
ArgumentException |  doc is a not cloud model, cannot execute this operation. -or- The document must be a cloud model with a valid project id. -or- The document does not support extended properties links.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The extended properties server does not exist.
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
ExtendedPropertiesLink Class
Autodesk.Revit.DB.ExternalData Namespace